{"meta":{"title":"夏汉林","subtitle":"蓝天白云下的细羽鸽子","description":"","author":"夏汉林","url":"http://xiahanlin1993.github.io","root":"/"},"pages":[{"title":"","date":"2022-10-10T02:53:47.819Z","updated":"2022-10-10T02:47:43.319Z","comments":true,"path":"baidu_verify_code-mqNlV1Cmvo.html","permalink":"http://xiahanlin1993.github.io/baidu_verify_code-mqNlV1Cmvo.html","excerpt":"","text":"746bb02d9f74abd7d8a20a7ce132d98c"},{"title":"about","date":"2018-09-30T09:25:30.000Z","updated":"2022-10-09T14:30:21.995Z","comments":true,"path":"about/index.html","permalink":"http://xiahanlin1993.github.io/about/index.html","excerpt":"","text":""},{"title":"friends","date":"2018-12-12T13:25:30.000Z","updated":"2022-10-11T13:34:28.503Z","comments":true,"path":"friends/index.html","permalink":"http://xiahanlin1993.github.io/friends/index.html","excerpt":"","text":"下面是我个人收藏的学者个人主页！（按首字母顺序排列） 一、宏观经济学领域二、计量经济学"},{"title":"categories","date":"2018-09-30T09:25:30.000Z","updated":"2022-10-09T14:28:38.342Z","comments":true,"path":"categories/index.html","permalink":"http://xiahanlin1993.github.io/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2018-09-30T10:23:38.000Z","updated":"2022-10-09T14:30:06.640Z","comments":true,"path":"tags/index.html","permalink":"http://xiahanlin1993.github.io/tags/index.html","excerpt":"","text":""},{"title":"resource","date":"2022-10-11T08:30:15.000Z","updated":"2023-02-13T17:08:59.980Z","comments":true,"path":"resource/index.html","permalink":"http://xiahanlin1993.github.io/resource/index.html","excerpt":"","text":"一、网站（一）在线数据网站1.科宽: 郑挺国教授开发的市场信号在线监测网站，包括指数、股票、基金、外汇、经济、房价等数据，使用指南。 指数：系统风险、沪深大盘、行业指数、商品期货、全球股指 股票：沪市、深市、创业板、港股、美股 基金：混合型、指数型、债券型、其他 外汇：货币汇率、虚拟货币 经济：中国经济、地区经济、行业经济、世界经济 房价：二手房价格（东中西部） 2.中国银行业数据库 | China Banking Database 请关注CBD微信公众号：CBD数据库 “中国银行业数据库”（China Banking Database，简称CBD）旨在构建覆盖中国商业银行业整体的大样本、微观数据库，服务于各界对中国银行业开展深入研究。自2015年项目启动以来，已取得丰富的基础成果，覆盖银行数量超过1000家，最长期限超过20年。由于一系列内外部原因，CBD数据库目前并未公开开放、自由使用，所有学术界、政策界、业界的使用均需取得CBD项目组授权。若有意使用该数据库，请直接联系项目组。未经授权而使用CBD数据形成的成果，均涉嫌侵犯知识产权，CBD项目组保留进一步追责的权利。 其他银行数据库常规的中国商业银行微观数据来源：Bankscope/Bankfocus，CSMAR，WIND，CNRDS CBD项目简要历程 CBD数据库介绍 [ CBD小传 ]，CBD极简介绍PPT，2021.7.25 [ CBD介绍 ] 2018年10月14日，经管院教工之家，CBD 3.0工作组招募宣讲会 CBD 0.0/0.5/1.0/2.0批次成员感受与寄语 [ CBD Retro 2018 ]，宣讲会介绍材料 [ CBD 3.0 Intro ] 2019年11月14日，B129，CBD 4.0工作组招募宣讲会 CBD 3.0成员感受 [ Link ]，宣讲会介绍材料 [ CBD4.0-Intro ] 2020年12月13日，CBD 5.0工作组招募宣讲会 CBD 4.0成员感言 [ Link ]，宣讲会介绍材料 [ CBD5.0-Intro ] 2021年11月25日，CBD 6.0工作组招募宣讲会 CBD 5.0成员感言 [ Link ]，宣讲会介绍材料 [ CBD6.0-Intro ] 2022年12月9日，CBD 7.0工作组招募宣讲会 CBD 6.0成员感受 [ Link ]，宣讲会介绍材料 [ CBD7.0-Intro ] CBD银行样本覆盖情况 2023-02-06 银行总数（含停业） Num. Banks (with exits) 营业银行数 Num. Banks (operating) CBD涵盖机构数 CBD Covered Banks CBD涵盖营业机构数 CBD Banks (operating) CBD银行-年份样本数 CBD Bank-Year Obs. 政策性及国有大型银行 Policy and State-owned Banks 9 9 9 9 161 股份制银行 Joint Stock Banks 12 12 12 12 227 城商行（含住房储蓄银行） City Commercial Banks (with housing savings bank) 156 126 155 125 2021 农商行（含农合行） Rural Commercial Banks (with Rural Cooperative Banks) 1665 1629 1088 1059 6265 农信社 Rural Credit Unions 544 544 123 114 577 村镇银行 Rural Banks 1645 1645 388 388 1082 民营银行 Private Banks 19 19 19 19 93 外资银行 Foreign Banks 43 41 43 41 464 总计 Total 4093 4025 1837 1767 10890 二、书籍（一）教材1、让.梯若尔《公司金融理论》 2、让.梯若尔《产业组织理论》 3、卡尔·沃什《货币理论与政策》-上财版 （二）专著1、余永定《见证失衡——双顺差、人民币汇率和美元陷阱》 2、温铁军等《八次危机：中国的真实经验（1949-2009）》 （三）工具书1、李春涛、张璇《随机模拟与金融数据处理Stata教程》 2、陈强《高级计量经济学及Stata应用-第2版》 3、李向阳《动态随机一般均衡（DSGE）模型：理论、方法和Dynare实践》 三、课程与讲义(一) Dingming Liu - XMU-SOE1、Advanced Topics in Macro: Fiscal Policies, Fall 2015(1) Lecture Notes by Evi Pappa: Empirical Evidence pdf Revenue Shocks pdf Fiscal Shocks in an Open Economy pdf Fiscal Shocks in RBC Models pdf Fiscal Shocks in Open Economy Models pdf1 pdf2 Models with Labor Market Frictions pdf (2) Lecture Notes by Giovanni Rico: Introduction pdf Empirics pdf Theory pdf Fiscal Foresight pdf 2.Derivatives Analysis (SAP), Spring 2018Syllabus doc Lecture 1 Introduction ppt Lecture 2 Mechanics of Futures Markets ppt上海期货交易所黄金期货合约：link大连交易所玉米合约：linkThe Furture Market （Reference only） Lecture 3 Hedging Strategies Using Futures ppt Lecture 4 Interest Rates ppt Lecture 5 Determination of Forward and Futures Prices pptMargin trading and short selling (融资融券) in China link Lecture 6 Interest Rate Futures pptUnderstanding U.S. Government Securities Quotes link2013年中国国债期货时隔18年后重启 linkU.S. treasury bond futures contract specs linkUnderstanding Treasury Futures by CME group linkUnderstanding Eurodollar Futures by CME group link Lecture 7 Swaps ppt Lecture 8 Mechanics of Options Markets ppt Lecture 9 Properties of Stock Options ppt Interesting Readings Check the following websites if you are interested in futures:Chicago Mercantile ExchangeIntercontinental Exchange data网站1 data网站2 了解中国衍生品市场的发展 http://www.zhihu.com/question/21691352/answer/23205199 （二）刘岩-武汉大学1、PhD Micro 2022（1）课程大纲 [ pdf ] （2）课程内容 数学基础提要 [ Lecture 0 ] 经典理论：消费者、厂商与一般均衡 [ Lecture 1 ] 动态随机一般均衡模型 [ Lecture 2 ] 不完全市场一般均衡模型 [ Lecture 3 ] 异质性信息与一般均衡模型 [ Lecture 4 ] 非合作博弈基础 [ Lecture 5 ] 不完美信息扩展博弈 [ Lecture 6 ] 逆向选择的理论与应用 [ Lecture 7 ] 道德风险与激励合约 [ Lecture 8 ] 企业理论与不完全合约 [ Lecture 9 ] 市场与政府 [ Lecture 10 ] （3）课程考核——撰写一份论文研究计划，要求如下： 标题应为“关于XXX的研究计划”，写清姓名 提出明确的研究问题，阐述该问题的理论意义以及可能的政策意义 注意，凡研究必有理论意义 列出5篇关键的中文参考文献及5篇关键的英文参考文献 注意，参考文献务必是期刊论文，且核心参考文献应当具备广泛认可的影响力，包括但不限于顶刊、高引用、可进入教科书的经典文献 具体陈述研究问题的理论逻辑 用文字清晰说明研究的主要理论逻辑框架，包括基础假设，推理逻辑，以及最终可以表示为变量X与Y间逻辑关系的命题 注意，请说明X与Y的逻辑关系是基于个体的最优化推理，还是基于市场均衡的联系 如果含有理论模型，则需对4中细节进行补充，并将模型基本设定数理化，但不必写出完整的数理推导过程及结论 如果含有实证研究，请说明拟采用的数据及数据可得性、可靠性，拟采用数据的结构（时序、截面、面板等），请具体写出拟使用的实证模型（线性回归、离散选择等）及估计方法，基准模型考虑何种标准误计算方法（稳健或聚类及层级），可能出现的内生性问题，预计将使用何种因果识别方法（IV、DID、RD等）减缓内生性问题的影响，以及该识别方法的合理性、实证模型及额外数据变量（如IV），准备考虑的稳健性检验 研究的预期结论，相对文献的贡献，预期结论的经济理论与政策显著性 预期投稿期刊，并对照近期该刊具体的发表论文，论证研究计划最终产出的论文可以达到该刊刊用标准 字数4000-5000 请用WORD撰写，A4纸张，正文5号字体，中文为宋体，英文为Times New Roman，1.2倍行距，数学公式用WORD自带公式编辑器输入（避免自行使用正常文本斜体输入数学字母及公式），参考文献排版按照《经济研究》规范 2、金融博士方法论专题2022模块一：公司金融实证方法授课人：刘岩；第三周开始，共计5次课 金融实证研究的基础问题，课件 [ slides ] 外生变动与工具变量回归，课件 [ slides ]；临时改为9.26中午12:30-3:30上课，地点不变 固定效应与面板回归，课件 [ slides ] 双重差分，课件 [ slides ] 断点回归，课件 [ slides ] 参考教材： 邱嘉平（2020），《因果推断实用计量方法》，上海财经大学出版社 [ 京东 ] 指定阅读文献： Roberts, M. R., and T. M. Whited. 2013. Endogeneity in Empirical Corporate Finance. Constantinides, G. M., M. Harris, and R. M. Stulz (eds.), Handbook of the Economics of Finance. Oxford: Elsevier. [ pdf ]【主要课程教学内容】 Kahn, R. J., and T. M. Whited. 2018. Identification Is Not Causality, and Vice Versa. Review of Corporate Finance Studies 7:1–21. [ pdf ]【区分识别与因果推断】 Mitton, T. 2022a. Methodological Variation in Empirical Corporate Finance. Review of Financial Studies 35:527–575. [ pdf ]【回归调结果问题】 Mitton, T. 2022b. Economic Significance in Corporate Finance. Review of Corporate Finance Studies forthcoming. [ pdf ]【回归系数经济显著性问题】 Jiang, W. 2017. Have Instrumental Variables Brought Us Closer to the Truth. Review of Corporate Finance Studies 6:127–140. [ pdf ]【工具变量问题】 Rajan, R. G., and L. Zingales. 1998. Financial Dependence and Growth. American Economic Review 88:559–586. [ pdf ]【实证研究范例】 Cameron, A. C., and D. L. Miller. 2015. A Practitioner’s Guide to Cluster-Robust Inference. Journal of Human Resources 50:317–372. [ pdf ]【多元聚类标准误说明】 Roodman, D. 2009. A Note on the Theme of Too Many Instruments. Oxford Bulletin of Economics and Statistics 71:135–158. [ pdf ]【动态面板GMM应用注意事项】 Olden, A., and J. Moen. 2020. The Triple Difference Estimator. http://ssrn.com/abstract=3582447. [ pdf ]【三重差分的识别条件及平行趋势检验】 Jayaratne, J., and P. E. Strahan. 1996. The Finance-Growth Nexus: Evidence from Bank Branch Deregulation. Quarterly Journal of Economics111:639–670. [ pdf ]【多期DID范例】 Chen, Ebenstein, Greenstone, and Li. 2013. Evidence on the impact of sustained exposure to air pollution on life expectancy from China’s Huai River policy. PNAS 110(32):12936–12941. [ pdf ]【地理界限RDD范例】 T. Chen, Y. Huang, C. Lin, and Z. Sheng. 2022. Finance and Firm Volatility: Evidence from Small Business Lending in China. Management Science 68(3):2226-2249. [ pdf ]【评分界限RDD范例】 模块二：实证资产定价与机器学习方法授课人：李斌；第6次课 模块三：DSGE进阶专题授课人：刘岩，王胜，熊琛，杨中超；第7-14次课，共8次课，每专题2次课 ——DSGE入门：参考熊琛春季学期硕士《动态优化》课程以及经济波动与增长论坛暑期课程（http://www.liuyanecon.com/efgchina/#2022ss） 开放宏观DSGE模型：王胜 金融摩擦与异质性主体模型：熊琛 信息冲击与信息摩擦：杨中超 中国宏观经济数据、特征与基础DSGE建模：刘岩 3、博士-金融中介理论2021教科书 主要教科书为：Xavier Freixas and Jean-Charles Rochet (2008) Microeconomics of Banking , 2nd edition, Cambridge: The MIT Press. 中译本：微观银行经济学（第二版），2014，北京：中国人民大学出版社 微观实证的参考书为：Hans Degryse, Moshe Kim, and Steven Ongena (2009) Microeconometrics of Banking: Methods, Applications, and Results , New York: Oxford University Press. 中译本：微观银行计量经济学，2018，厦门：厦门大学出版社 课程内容本课程将以金融中介理论为基础，前半部分选读Freixas and Rochet (2008)的主要内容，每次两人主讲，各准备80分钟的汇报PPT，40页左右；后半部分选读前沿文献，每次两人，各一篇论文，具体论文待定 9月27日：课程阅读内容分配 课件：pdf 下载 10月11日：FR第2 – 3章 10月18日：FR第4 – 5章 10月25日：FR第6 – 7章 11月1日：FR第8 – 9章 注意事项 使用PPT模板 Download ；学术报告规范 Link Download 4、PhD Micro 2017（1）课程大纲 [ pdf ] （2）课程内容 数学基础提要 [ lecture0 ] 微观经济学经典理论 [ lecture1 ] 动态随机一般均衡模型基础 [ lecture2 ] 完全市场动态随机一般均衡 [ lecture3 ] 不完全市场动态随机一般均衡 [ lecture4 ] 异质信息与一般均衡 [ lecture5 ] 非合作博弈基础 [ lecture6 ] 不完美信息扩展博弈 [ lecture7 ] 逆向选择理论与应用 [ lecture8 ] 道德风险与激励合约 [ lecture9 ] 最优债务合约 [ lecture10 ] 不完全合约及企业理论 [ lecture11 ] （3）作业 hw1，solution1 hw2，solution2 hw3，solution3 hw4 hw5 hw6 hw7 hw8 hw9 hw10 hw11 4、PhD DSGE 2017 课程大纲 [ DSGE_syllabus_2017 ] 第一讲：刘岩，DSGE介绍，课件 [ pdf ] 第二讲：曾涛，DSGE Bayes方法 [ pdf ] 与Dynare使用 [ pdf ] 第三讲：侯成琪，New Keynesian DSGE [ pdf ]，脉冲响应示例 [ pdf ] 第四讲：王胜，开放经济 DSGE [ pdf ]，脉冲响应示例 [ pdf ] 第五讲（2016）：葛新宇，DSGE与金融中介 [ pdf ] 5、Macro reading group本学期宏观讨论班将以HANK为主题，每两周周一下午2点半在金融系会议室（B255）进行。由于技术性较强，面向对象为金融系教师和博士生；本科、硕士有兴趣旁听者请提前向我邮件申请。 Learn how to write academic presentation slides [ my own introduction link ] by using a PPT template [ sample file link ] or a LaTeX beamer template [ sample file link ] 讨论班安排 9月28日，刘岩，报告内容：RANK存在问题，TANK介绍；参考资料 Bilbiie-THANK Download 10月12日，刘岩，报告内容：THANK介绍；参考资料 Bilbiie-THANK Download 10月27日，熊琛，报告内容：Bewley模型；参考资料 pdf Download 11月9日，熊琛，报告内容：Krusell-Smith模型；参考资料 pdf Download 12月3日，周上尧，报告内容：Bayer, Born, and Luetticke (2020)，HANK版Smets and Wouters (2007)；参考资料 pdf Download 12月14日，周上尧，报告内容：Bayer and Luetticke (2020)，离散时间HANK近似求解方法；参考资料 pdf Download 1月13日，邹振涛，报告内容：Kaplan, Moll, and Violante (2018)，连续时间HANK；参考资料 pdf Download 主要文献HANK综述及微观数据基础 Greg Kaplan, Giovanni L. Violante (2018) Microeconomic Heterogeneity and Macroeconomic Shocks. Journal of Economic Perspectives, 32 (3), 167 – 94. pdf Download Greg Kaplan, Giovanni L. Violante, Justin Weidner (2014) The Wealthy Hand-to-Mouth. Brookings Papers on Economic Activity, 2014, 77 – 138. pdf Download TANK/THANK介绍及应用 Florin O. Bilbiie (2020) The New Keynesian Cross. Journal of Monetary Economics, 114, 90 – 108. pdf Download Davide Debortoli, Jordi Galí (2018) Monetary Policy with Heterogeneous Agents: Insights from TANK models. Working Paper. pdf Download Gauti B. Eggertsson, Paul Krugman (2012) Debt, Deleveraging, and the Liquidity Trap: A Fisher-Minsky-Koo Approach. Quarterly Journal of Economics, 127 (3), 1469 – 1513. pdf Download HANK主要文献：封闭经济 Alisdair McKay, Ricardo Reis (2016) The Role of Automatic Stabilizers in the U.S. Business Cycle. Econometrica, 84 (1), 141 – 194. pdf Download Alisdair McKay, Emi Nakamura, Jón Steinsson (2016) The Power of Forward Guidance Revisited. American Economic Review, 106 (10), 3133 – 58. pdf Download Veronica Guerrieri, Guido Lorenzoni (2017) Credit Crises, Precautionary Savings, and the Liquidity Trap. Quarterly Journal of Economics, 132 (3), 1427 – 1467. pdf Download Greg Kaplan, Benjamin Moll, Giovanni L. Violante (2018) Monetary Policy According to HANK. American Economic Review, 108 (3), 697 – 743. pdf Download Adrien Auclert (2019) Monetary Policy and the Redistribution Channel. American Economic Review, 109 (6), 2333 – 67. pdf Download Christian Bayer, Ralph Luetticke, Lien Pham-Dao, Volker Tjaden (2019) Precautionary Savings, Illiquid Assets, and the Aggregate Consequences of Shocks to Household Income Risk. Econometrica, 87 (1), 255 – 290. pdf Download Christian Bayer, Benjamin Born, Ralph Luetticke (2020) Shocks, Frictions, and Inequality in US Business Cycles. CEPR Discussion Paper. pdf Download [NEW] Felipe Alves, Greg Kaplan, Benjamin Moll, Giovanni L. Violante (2020) A Further Look at the Propagation of Monetary Policy Shocks in HANK. Journal of Money, Credit and Banking, 52 (S2), 521–559. pdf Download HANK主要文献：开放经济 Sergio de Ferra, Kurt Mitman, Federica Romei (2020) Household Heterogeneity and the Transmission of Foreign Shocks. Journal of International Economics, 124, 103303. pdf Download HANK主要文献：最优政策 Alisdair McKay, Ricardo Reis (2020) Optimal Automatic Stabilizers. Review of Economic Studies, forthcoming. pdf Download 异质性个体量化宏观模型理论基础与数值求解 S. Rao Aiyagari (1994) Uninsured Idiosyncratic Risk and Aggregate Saving. Quarterly Journal of Economics, 109 (3), 659 – 684. pdf Download Mark Huggett (1993) The Risk-free Rate in Heterogeneous-Agent Incomplete-Insurance Economies. Journal of Economic Dynamics and Control, 17 (5-6), 953 – 969. pdf Download Per Krusell, Anthony A. Smith Jr. (1998) Income and Wealth Heterogeneity in the Macroeconomy. Journal of Political Economy, 106 (5), 867 – 896. pdf Download Fatih Guvenen (2011) Macroeconomics with Hetereogeneity: A Practical Guide. Economic Quarterly, 97 (3), 255 – 326. pdf Download Michael Reiter (2009) Solving Heterogeneous-agent Models by Projection and Perturbation. Journal of Economic Dynamics and Control, 33 (3), 649 – 665. pdf Download Timo Boppart, Per Krusell, Kurt Mitman (2018) Exploiting MIT Shocks in Heterogeneous-Agent Economies: The Impulse Response as a Numerical Derivative. Journal of Economic Dynamics and Control, 89, 68 – 92. pdf Download Christian Bayer, Ralph Luetticke (2020) Solving Heterogeneous Agent Models in Discrete Time with Many Idiosyncratic States by Perturbation Methods. Quantitative Economics, 11 (4), 1253 – 1288. pdf Download Yves Achdou, Jiequn Han, Jean-Michel Lasry, Pierre-Louis Lions, Benjamin Moll (2020) Income and Wealth Distribution in Macroeconomics:A Continuous-Time Approach. Review of Economic Studies, forthcoming. pdf Download 6、Macro reading group 2022 刘岩，3月22日，The Driving Forces of China’s Business Cycles: Evidence from an Estimated DSGE Model with Housing and Banking, CER, 2022 肖雅慧，4月12日，Carvalho, Lee, and Park (2021, AEJ Macro) 赵浩权，4月19日，Christiano, Motto, and Rostagno (2014, AER) 王浩安，4月26日，Chang, Liu, and Spiegel (2015, JME) 肖泽亮，5月9日，Gertler and Kiyotaki (2015, AER) 周上尧，5月16日，“中国影子银行的成因、结构及系统性风险”，《经济研究》，2021年第7期 刘岩，5月23日，Cochrane (2022, RED) 刘熙莹，5月30日，Beyond Monopolistic Competition 阅读文献列表： [B]金融摩擦 Brunnermeier, M. K., &amp; Sannikov, Y. (2014). A Macroeconomic Model with a Financial Sector. American Economic Review, 104, 379–421. Chang, C., Liu, Z., Spiegel, M. M., &amp; Zhang, J. (2019). Reserve Requirements and Optimal Chinese Stabilization Policy. Journal of Monetary Economics, 103, 33–51. Christiano, L. J., Motto, R., &amp; Rostagno, M. (2014). Risk Shocks. American Economic Review, 104, 27–65. Gertler, M., &amp; Kiyotaki, N. (2015). Banking, Liquidity, and Bank Runs in an Infinite Horizon Economy. American Economic Review, 105, 2011–2043. [C]资本管制 Chang, C., Liu, Z., &amp; Spiegel, M. M. (2015). Capital Controls and Optimal Chinese Monetary Policy. Journal of Monetary Economics, 74, 1–15. Choi, J. H. (2020). Capital Controls and Foreign Exchange Market Intervention. Journal of International Money and Finance, 101, 102098. Prasad, N. (2018). Sterilized Interventions and Capital Controls. Journal of International Money and Finance, 88, 101–121. [D]企业融资（实证为主） Kermani, A., &amp; Ma, Y. (2020). Two tales of debt (No. w27641). National Bureau of Economic Research. Lian, C., &amp; Ma, Y. (2021). Anatomy of Corporate Borrowing Constraints. Quarterly Journal of Economics, 136, 229–291. Ma, Y., &amp; Scheinkman, J. A. (2020). Going-concern debt of financial intermediaries (No. w28088). National Bureau of Economic Research. [F]价格/通胀的财政理论 Cochrane, J. H. (2021). The Fiscal Roots of Inflation. Review of Economic Dynamics, forthcoming. Sargent, T. J. (2012). Nobel Lecture: United States Then, Europe Now. Journal of Political Economy, 120, 1–40. [P]生产网络 Carvalho C, Lee J W, Park W Y. Sectoral price facts in a sticky-price model. American Economic Journal: Macroeconomics, 2021, 13(1): 216-56. Pasten E, Schoenle R, Weber M. The propagation of monetary policy shocks in a heterogeneous production economy. Journal of Monetary Economics, 2020, 116: 1-22. [O]人口结构、老龄化 Basso H S, Rachedi O. The young, the old, and the government: Demographics and fiscal multipliers. American Economic Journal: Macroeconomics, 2021, 13(4): 110-41. Carvalho C, Ferrero A, Nechio F. Demographics and real interest rates: Inspecting the mechanism. European Economic Review, 2016, 88: 208-226. [T]技术进步 Anzoategui D, Comin D, Gertler M, et al. Endogenous technology adoption and R&amp;D as sources of business cycle persistence. American Economic Journal: Macroeconomics, 2019, 11(3): 67-110. Bianchi F, Kung H, Morales G. Growth, slowdowns, and recoveries. Journal of Monetary Economics, 2019, 101: 47-63. 7、Causal inference reading group 2019Reference books Angrist and Pischke, Mostly Harmless Econometrics, 2009 赵西亮，《基本有用的计量经济学》，2017 Organizaiton and introductionRead the pdf slides 下载 Use the required PPT template to compose the presentation slides 下载 Presentations 胡智慧：下载 梁思靖：下载 孔彤阳：下载 鲍余薇：下载 荆艺玮：下载 冷学琪：下载 张雪菲：下载 赵瑾：下载 相耐汀：下载 8、Causal inference reading group 2020The reading group will last for the whole semester, and will cover the following topics, mostly related to causal inference, or endogeneity problems in an OLS setting: Robust and clustered standard errors\\ to achieve robust inference in an OLS model Instrumental variable approach\\ to attack the endogeneity problems wide spread in OLS models Panel data with fixed effects\\ to solve for the unobservable heterogeneity problem, an important source of endogeneity issues GMM approach for dynamic panels\\, where fixed effects lead to inconsistent estimates using OLS Difference-in-difference approach\\ for policy evaluation or shock identification, one of the most popular method to overcome the endogeneity issues in recent years Regression discontinuity design\\, an equally popular method for endogeneity problems in recent years Quantile regression, especially useful to analyze inequality issues and uncover heterogeneous effects of explanatory variables Reference books 邱嘉平，《因果推断实用计量方法》，2020 (REQUIRED) Angrist and Pischke, Mostly Harmless Econometrics, 2009 赵西亮，《基本有用的计量经济学》，2017 Use the required PPT template to compose the presentation slides Download Check the Introduction Slides first CIRG2020Intro Download For guidelines on composing academic slides, see Link Download Presentations 9/17, introduction, and presentations of summer research by 程子帅 梁思靖 胡智慧 9/24, presentations of summer research and undergraduate thesis by 郭倩美 pdf Download 马兆星 pdf Download 张雪菲 pdf Download 10/8, presentations of summer research; begin at 2:40pm instead of 2:00pm 孔彤阳 pdf Download 相耐汀 pdf Download 10/15, presentations of summer research; begin at 3:00pm instead of 2:00pm 鲍余薇 pdf Download 冷学琪 pdf Download 10/22, presentations of CI methodology 王健 pdf Download 相耐汀 pdf Download 蔡诺璇 pdf Download 10/29, presentations of CI methodology 李非凡 pdf Download 李思芃 pdf Download 李浩芸 pdf Download 11/5, presentations of CI methodology 曾卉琪 pdf Download 江梦瑜 pdf Download 陈远致 pdf Download 11/19, presentations of CI methodology; start at 1:00 pm instead of 2:00 pm 朱思颖 pdf Download 侯天宇 pdf Download 叶立欢 pdf Download 11/26, presentations of CI methodology 陈露滢 pdf Download 成思扬 pdf Download 郭倩美 pdf Download 补充 pdf Download 12/03, presentations of CI methodology 蒋涵琦 pdf Download 王子萱 pdf Download 马兆星 pdf Download 12/10, presentations of CI methodology 李竞开 pdf Download 12/17, presentations of CI methodology 杨宇彤 pdf Download 瞿博洋 pdf Download 龙欣雨 pdf Download 9、经济波动与增长论坛暑期学校2022：为进一步推动国内宏观经济学量化研究，促进中国特色宏观经济理论的发展，经济波动与增长论坛联合云南财经大学，计划以线下形式于2022年7月在昆明举办首届暑期学校。现面向全国高校致力于从事量化宏观研究的优秀博士、硕士研究生以及有必要知识基础的优秀本科生，招收暑期学校学员。暑期学校计划招收学员规模不超过50人，并将组织国内知名的宏观经济学中青年学者集中讲授宏观动态模型的一般理论与面向中国的建模分析方法。暑期学校预计将持续4天，前3天为集中授课（上下半天，共6次），最后1天为宏观研讨会（欢迎学员报名参加进行论文展示）。 举办时间7.4-7.7，昆明：报名公告 [ link ] 日程安排 [ link ] 课件 李戎：动态优化基础，课件 [ slides ] 刘岩：DSGE模型入门与对数线性化方法，课件 [ slides ] 薛涧坡：动态稳定性与冲击，课件 [ slides ] 许志伟：新凯恩斯模型与货币政策，课件 [ slides ] 彭玉磊：金融摩擦，课件 [ slides ] 杨光：Dynare介绍，课件 [ slides ] 研讨报告：DSGE模型在中国的研究进展与展望 报告 [ slides ] 论文链接 [ link ] 补充材料：“兼爱非攻则天下治”，工作论文 [ link ] 发表缩略版 [ link ] （三）Paul Goldsmith-Pinkham and Lars VilhuberA wonderful set of slides &amp; sample codes from an applied methods course in Yale by Paul Goldsmith-Pinkham and Lars Vilhuber available at Github [ link ] 四、视频（一）许志钦 最优化方法课程1、最优化方法1: 介绍 2、最优化方法2：凸集 3、最优化方法3: 凸函数 4、最优化方法4 : 凸优化问题第一部分 5、最优化方法5 : 凸优化问题第二部分 6、最优化方法6 : Duality 7、最优化方法7 : CVX, 逼近与拟合 8、最优化8：统计估计 9、最优化9：SVM, Norm, SVD 10、最优化10：复杂度及线性代数补充 11、最优化11：无约束优化 12、最优化12：等式约束最小化 13、最优化13：内点法 14、最优化14：次梯度 15、最优化15：1ADMM 讲义：https://ins.sjtu.edu.cn/people/xuzhiqin/2020opti/ 五、其他（一）文献及代码 1、Smets &amp; L Wouters：Shocks and Frictions in US Business Cycles: A Bayesian DSGE Approach pdf wp appendix 官方ppt1 ppt2 Uhlig-ppt3 code SW2007方程推导和结果复现"},{"title":"科研主页","date":"2022-10-12T08:52:19.000Z","updated":"2022-10-12T09:21:07.757Z","comments":true,"path":"科研主页/index.html","permalink":"http://xiahanlin1993.github.io/%E7%A7%91%E7%A0%94%E4%B8%BB%E9%A1%B5/index.html","excerpt":"","text":"科研主页"}],"posts":[{"title":"宏观金融","slug":"宏观金融","date":"2021-08-24T01:58:16.000Z","updated":"2022-10-11T12:42:57.657Z","comments":true,"path":"2021/08/24/hong-guan-jin-rong/","link":"","permalink":"http://xiahanlin1993.github.io/2021/08/24/hong-guan-jin-rong/","excerpt":"摘要","text":"摘要 正文firm investment and growth corporate, household and sovereign debt asset pricing in general equilibrium equilibrium macro models with a financial sector. 1 1 1 2 6 1 文章标题，强烈建议填写此选项 3 1 1 4 1 1 y_2=3 ss 配置选项 默认值 描述 title Markdown 的文件标题 文章标题，强烈建议填写此选项 date 文件创建时的日期时间 发布时间，强烈建议填写此选项，且最好保证全局唯一 author 根 _config.yml 中的 author 文章作者 img featureImages 中的某个值 文章特征图，推荐使用图床(腾讯云、七牛云、又拍云等)来做图片的路径.如: http://xxx.com/xxx.jpg top true 推荐文章（文章是否置顶），如果 top 值为 true，则会作为首页推荐文章 cover false v1.0.2版本新增，表示该文章是否需要加入到首页轮播封面中 coverImg 无 v1.0.2版本新增，表示该文章在首页轮播封面需要显示的图片路径，如果没有，则默认使用文章的特色图片 password 无 文章阅读密码，如果要对文章设置阅读验证密码的话，就可以设置 password 的值，该值必须是用 SHA256 加密后的密码，防止被他人识破。前提是在主题的 config.yml 中激活了 verifyPassword 选项 toc true 是否开启 TOC，可以针对某篇文章单独关闭 TOC 的功能。前提是在主题的 config.yml 中激活了 toc 选项 mathjax false 是否开启数学公式支持 ，本文章是否开启 mathjax，且需要在主题的 _config.yml 文件中也需要开启才行 summary 无 文章摘要，自定义的文章摘要内容，如果这个属性有值，文章卡片摘要就显示这段文字，否则程序会自动截取文章的部分内容作为摘要 categories 无 文章分类，本主题的分类表示宏观上大的分类，只建议一篇文章一个分类 tags 无 文章标签，一篇文章可以多个标签 keywords 文章标题 文章关键字，SEO 时需要 reprintPolicy cc_by 文章转载规则， 可以是 cc_by, cc_by_nd, cc_by_sa, cc_by_nc, cc_by_nc_nd, cc_by_nc_sa, cc0, noreprint 或 pay 中的一个 pdf","categories":[],"tags":[]},{"title":"实证研究方法","slug":"实证研究方法","date":"2021-08-23T06:30:47.000Z","updated":"2022-10-09T14:27:05.505Z","comments":true,"path":"2021/08/23/shi-zheng-yan-jiu-fang-fa/","link":"","permalink":"http://xiahanlin1993.github.io/2021/08/23/shi-zheng-yan-jiu-fang-fa/","excerpt":"摘要","text":"摘要 正文Machine Learning and Causal Inference Susan Athey, Stanford University and NBER About this author at RePEc Summer Institute 2015 Methods Lecture: Unsupervised Learning: Applications to Networks and Text Mining 夏季研究所2015年方法讲座: 非监督式学习: 应用于网络和文本挖掘 Summer Institute 2015 Methods Lectures: Machine Learning for Economists 暑期研究所2015年方法讲座: 经济学家的机器学习 Summer Institute 2015 Methods Lecture: Introduction to Supervised ML Concepts and Algorithms 2015年夏季学院方法讲座: 有监督的机器学习概念和算法简介 Summer Institute 2015 Methods Lecture: Prediction, Classification, and Applications Network Models 暑期学院2014方法讲座: 网络模型的理论与应用https://www.nber.org/people/matthew_jackson) Summer Institute 2014 Methods Lecture: Networks: Games over Networks and Peer Effects 夏季研究所2014年方法讲座: 网络: 网络上的游戏和对等效应 Summer Institute 2014 Methods Lecture: Networks: Propagation of Shocks over Economic Networks 夏季研究所2014年方法讲座: 网络: 冲击在经济网络上的传播 Summer Institute 2014 Methods Lecture: Social and Economic Networks: Background 2014年夏季研究所方法讲座: 社会和经济网络: 背景 Summer Institute 2014 Methods Lecture: Diffusion, Identification, Network Formation 夏季学院2014年方法讲座: 扩散，识别，网络形成 Summer Institute 2014 Methods Lectures: Theory and Application of Network Models 暑期学院2014方法讲座: 网络模型的理论与应用 Summer Institute 2013 Methods Lecture: Applications: Using Text as Data 暑期学院2013年方法讲座: 应用: 使用文本作为数据 因果推断Causal Inference，中英文字幕—https://www.bradyneal.com/causal-inference-course Introduction to Causal Inference Fall 2020 You’ve found the online causal inference course page. Although, the course text is written from a machine learning perspective, this course is meant to be for anyone with the necessary prerequisites who is interested in learning the basics of causality. I do my best to integrate insights from the many different fields that utilize causal inference such as epidemiology, economics, political science, machine learning, etc. You can see the tentative course schedule below. You can join the course Slack workspace where you can easily start discussions with other people who are interested in causal inference. For information about office hours, see the office hours section below. If you’re interested in leading a reading group discussion, check out the suggested reading group papers to see if one piques your interest. When emailing me about this course, please include “[Causal Course]” at the beginning of your email subject to help make sure I see your email. If you want to receive course updates, sign up for the course mailing list. The main textbook we’ll use for this course is Introduction to Causal Inference (ICI), which is a book draft that I’ll continually update throughout this course. Course Schedule (tentative)Note about slides: they currently don’t work well with Adobe Acrobat, though they seem to work with other PDF viewers. Week Topics Lecture Readings Reading Group Paper August 31 Motivation Course Preview Course Information Video Slides Info Chapter 1 of ICI None September 7 Potential Outcomes A Complete Example with Estimation Video Slides Chapter 2 of ICI Does obesity shorten life? The importance of well-defined interventions to answer causal questions (Hernán &amp; Taubman, 2008) September 14 Graphical Models Video Slides Chapter 3 of ICI Does Obesity Shorten Life? Or is it the Soda? On Non-manipulable Causes (Pearl, 2018) September 21 Backdoor Adjustment Structural Causal Models Video Slides Chapter 4 of ICI Single World Intervention Graphs: A Primer (Richardson &amp; Robins, 2013) September 28 Randomized Experiments Frontdoor Adjustment do-calculus Graph-Based Identification Video Slides Chapters 5-6 of ICI On Pearl’s Hierarchy and the Foundations of Causal Inference (Bareinboim et al., 2020) October 5 Estimation Susan Athey Guest Talk - Estimating Heterogeneous Treatment Effects (Oct 8th at 3 - 4 pm EDT) Video Slides Guest Talk Chapter 7 of ICI Adapting Neural Networks for the Estimation of Treatment Effects (Shi, Blei, Veitch, 2019) October 12 Unobserved Confounding, Bounds, and Sensitivity Analysis Video Slides Chapter 8 of ICI Sense and Sensitivity Analysis: Simple Post-Hoc Analysis of Bias Due to Unobserved Confounding (Veitch &amp; Zaveri, 2020) October 19 Instrumental Variables Video Slides Chapter 9 of ICI Deep IV: A Flexible Approach for Counterfactual Prediction (Hartford et al., 2017) October 26 Difference-in-Differences Alberto Abadie Guest Talk - Synthetic Control (Oct 29th at 10 - 11 am EDT) Video Slides Guest Talk Chapter 10 of ICI Regression Discontinuity Designs in Economics (Lee &amp; Lemieux, 2010) November 2 —- Break Week - No Lecture —- None Past Readings None November 9 Causal Discovery from Observational Data Jonas Peters Guest Talk (November 13 at 10 am EST) Video Slides Chapter 11 of ICI Inferring causation from time series in Earth system sciences (Runge et al., 2019) November 16 Causal Discovery from Interventions Video Slides Chapter 12 of ICI (Coming soon) Permutation-based Causal Inference Algorithms with Interventions (Wang et al., 2017) November 23 Transfer Learning Transportability Video Slides Chapter 13 of ICI (Coming soon) A causal framework for distribution generalization (Christiansen et al., 2020) November 30 Yoshua Bengio Guest Talk - Causal Representation Learning (Dec 1st at 1 - 2:30 pm EST) Guest Talk Slides None Invariant Risk Minimization (Arjovsky et al., 2019) December 7 Counterfactuals Mediation Video Slides Chapter 14 of ICI (Coming soon) Identifiability of Path-Specific Effects (Avin, Shpitser, &amp; Pearl, 2005) Potential Reading Group Papers by WeekWe will have a small weekly reading group that runs in parallel to the course. Before any given week’s reading group meeting, 1-3 people will have read the week’s paper in detail and already thought about discussion topics. These 1-3 people will then lead a discussion of a small number of people who have all made themselves familiar with the paper. The discussion group will be kept small (at most 15) in order to facilitate quality discussion. You can ensure that you have a place in the discussion group every week you’d like by signing up to be a discussion leader for at least one week. Below, I give a list of potential reading group papers, organized by week/topic, just like the course schedule is. You can email me at bradyneal11@gmail.com to let me know that you’d like to lead a certain week’s discussion, which paper(s) you’re considering, or to discuss other papers you’d like to discuss that are not on the list. Motivation and Preview - No reading group Potential Outcomes Does obesity shorten life? The importance of well-defined interventions to answer causal questions (Hernán &amp; Taubman, 2008) Does Obesity Shorten Life? Or is it the Soda? On Non-manipulable Causes (Pearl, 2018) Graphical Models and SCMs On the Interpretation of do(x) (Pearl, 2019) Quantifying causal influences (Janzing et al., 2012) Trygve Haavelmo and the Emergence of Causal Calculus (Pearl, 2014) Randomized Experiments, Frontdoor Adjustment, and do -calculus Single World Intervention Graphs: A Primer (Richardson &amp; Robins, 2013) The Paper of How: Estimating Treatment Effects Using the Front-Door Criterion (Bellemare &amp; Bloem, 2019) On Pearl’s Hierarchy and the Foundations of Causal Inference (Bareinboim et al., 2020) Estimation and Conditional Average Treatment Effects Estimating individual treatment effect: generalization bounds and algorithms (Shalit, Johansson, &amp; Sontag, 2017) Adapting Neural Networks for the Estimation of Treatment Effects (Shi, Blei, Veitch, 2019) Generalized Random Forests (Athey, Tibshirani, Wager, 2019) Meta-learners for Estimating Heterogeneous Treatment Effects using Machine Learning (Künzel et al., 2017) (caution: not about meta-learning in the ML sense) Sensitivity Analysis Making sense of sensitivity: extending omitted variable bias (Cinelli &amp; Hazlett, 2019) Sense and Sensitivity Analysis: Simple Post-Hoc Analysis of Bias Due to Unobserved Confounding (Veitch &amp; Zaveri, 2020) An Introduction to Sensitivity Analysis for Unobserved Confounding in Non-Experimental Prevention Research (Liu, Kuramoto, &amp; Stuart, 2013) Sensitivity Analysis of Linear Structural Causal Models (Cinelli et al., 2019) Instrumental Variables, Regression Discontinuity, Difference-in-Differences, and Synthetic Control Improving Causal Inference: Strengths and Limitations of Natural Experiments (Dunning, 2007) Alternative Causal Inference Methods in Population Health Research: Evaluating Tradeoffs and Triangulating Evidence (Mattay et al., 2019) Deep IV: A Flexible Approach for Counterfactual Prediction (Hartford et al., 2017) Regression Discontinuity Designs in Economics (Lee &amp; Lemieux, 2010) Synthetic Controls (there are several different Abadie papers; message me, if you’re interested in this topic) BREAK Causal Discovery without Experiments Inferring causation from time series in Earth system sciences (Runge et al., 2019) Distinguishing Cause from Effect Using Observational Data: Methods and Benchmarks (Mooij et al., 2016) Do-calculus when the True Graph Is Unknown (Hyttinen, Eberhardt, Jarvisalo, 2015) Review of Causal Discovery Methods Based on Graphical Models (Glymour, Zhang, &amp; Spirtes, 2019) Causal inference by using invariant prediction: identification and confidence intervals (Peters, Bühlmann &amp; Meinshausen, 2016) Nonlinear causal discovery with additive noise models (Hoyer et al., 2008) Causal Discovery from Heterogeneous/Nonstationary Data with Independent Changes (Huang et al., 2020) Causal Discovery with Experiments Experiment Selection for Causal Discovery (Hyttinen, Eberhardt, Hoyer, 2013) Characterization and Greedy Learning of Interventional Markov Equivalence Classes of Directed Acyclic Graphs (Hauser &amp; Bühlmann, 2012) Characterizing and Learning Equivalence Classes of Causal DAGs under Interventions (Yang, Katcoff, &amp; Uhler, 2018) Joint Causal Inference from Multiple Contexts (Mooij, Magliacane, &amp; Claassen, 2020) Transportability and Transfer Learning External Validity: From Do-Calculus to Transportability Across Populations (Pearl &amp; Bareinboim, 2014) A causal framework for distribution generalization (Christiansen et al., 2020) Causal inference and the data-fusion problem (Bareinboim &amp; Pearl, 2016) On Causal and Anticausal Learning (Schölkopf et al., 2012) Domain Adaptation under Target and Conditional Shift (Zhang et al., 2013) Multi-Source Domain Adaptation: A Causal View (Zhang, Gong, &amp; Schölkopf., 2015) Invariant Models for Causal Transfer Learning (Rojas-Carulla et al., 2016) Domain Adaptation As a Problem of Inference on Graphical Models (Zhang et al., 2020) Domain Adaptation by Using Causal Inference to Predict Invariant Conditional Distributions (Magliacane et al., 2018) Counterfactuals, Mediation, and Path-Specific Effects Identification, Inference and Sensitivity Analysis for Causal Mediation Effects (Imai, Keele, &amp; Yamamoto, 2010) Identifiability of Path-Specific Effects (Avin, Shpitser, &amp; Pearl, 2005) Interpretation and Identification of Causal Mediation (Pearl, 2014) TBD - Overflow Week Causal Representation Learning Visual Causal Feature Learning (Chalupka, Perona, &amp; Eberhardt, 2015) Discovering causal signals in images (Lopez-Paz et al., 2017) Invariant Risk Minimization (Arjovsky et al., 2019) Summer Institute 2021 Methods Lectures: Causal Inference Using Synthetic Controls and Regression Discontinuity Designs Causal inference James M. Robins 因果推断学习分享 Causal Inference BookJamie Robins and I have written a book that provides a cohesive presentation of concepts of, and methods for, causal inference. Much of this material is currently scattered across journals in several disciplines or confined to technical articles. We expect that the book will be of interest to anyone interested in causal inference, e.g., epidemiologists, statisticians, psychologists, economists, sociologists, political scientists, computer scientists… The book is divided in 3 parts of increasing difficulty: causal inference without models, causal inference with models, and causal inference from complex longitudinal data. To cite the book, please use “Hernán MA, Robins JM (2020). Causal Inference: What If. Boca Raton: Chapman &amp; Hall/CRC.” This book is only available online through this page. A print version (for purchase) is expected to become available some time in the future. The exact time, when known, will be announced here. The components of the book can be accessed by clicking on the links below: The Causal Inference book (1st edition, 2020) NHEFS data In SAS, Stata, MS Excel, and CSV formats Codebook Computer code SAS by Roger Logan Stata by Eleanor Murray and Roger Logan R by Joy Shi and Sean McGrath. Rendered version by Tom Palmer. Python by James Fiedler Parametric g-formula software in R and SAS Warning: At this stage, we may still revise and correct errors without documenting the changes. Please make sure you use the most updated version of the book posted here. Summer Institute 2011 Methods Lecture: Applications: Indeterminacy and Sunspots 夏季研究所2011年方法讲座: 应用: 不确定性和太阳黑子 Summer Institute 2011 Methods Lecture: Dynare Exercise 夏季学院2011年方法讲座: 动态运动 Summer Institute 2011 Methods Lecture: Projection Methods Summer Institute 2011 Methods Lecture: Models with Heterogeneous Agents Summer Institute 2011 Methods Lectures: Computational Tools &amp; Macroeconomic Applications 2011年夏季学院方法讲座: 计算工具和宏观经济应用 Summer Institute 2011 Methods Lecture: Introduction: Perturbation and projection methods for solving DSGE models 夏季研究所2011年方法讲座: 介绍: 解决 DSGE 模型的摄动和投影方法 Summer Institute 2011 Methods Lecture: Financial Frictions Under Asymmetric Information and Costly State Verification 夏季学院2011年方法讲座: 信息不对称和昂贵的国家核查下的金融摩擦 Summer Institute 2011 Methods Lecture: Why Non Linear/Non-Gausian DSGE Models? Recursive preferences, stochastic volatility, large shocks 夏季研究所2011年方法讲座: 为什么非线性/非高斯 DSGE 模型? 递归偏好，volatility model，大冲击 Summer Institute 2011 Methods Lecture: Perturbation Methods 夏季研究所2011年方法讲座: 摄动法 Summer Institute 2008 Methods Lecture: The Kalman filter, Nonlinear filtering, and Markov Chain Monte Carlo 2008年夏季研究所方法讲座: 卡尔曼滤波，非线性滤波和马尔科夫蒙特卡洛 Summer Institute 2008 Methods Lecture: Specification and estimation of models with stochastic time variation 夏季研究所2008年方法讲座: 随机时间变化模型的规格和估计 Summer Institute 2008 Methods Lecture: Recent Developments in Structural VAR Modeling 夏季研究所2008年方法讲座: 结构 VAR 模型的最新进展 Summer Institute 2008 Methods Lecture: Econometrics of DSGE Models 2008年夏季研究所方法讲座: DSGE 模型的计量经济学 Summer Institute 2008 Methods Lectures: What’s New in Econometrics: Time Series 暑期研究所2008年方法讲座: 计量经济学的新进展: 时间序列 Summer Institute 2010 Methods Lecture: GMM and Consumption-Based Asset Pricing Models 夏季研究所2010年方法讲座: 广义矩和基于消费的资产定价模型 Summer Institute 2010 Methods Lecture: Linear Factor Models and Event Studies 暑期学院2010年方法讲座: 线性因素模型和事件研究 Summer Institute 2007 Methods Lecture: Linear Panel Data Models 夏季学院2007年方法讲座: 线性面板数据模型 Summer Institute 2007 Methods Lecture: Regression Discontinuity Designs 夏季研究所2007年方法讲座: 回归间断设计 Summer Institute 2007 Methods Lecture: Estimation of Average Treatment Effects Under Unconfoundedness 夏季研究所2007年方法讲座: 平均治疗效果估计在不混淆 Summer Institute 2007 Methods Lecture: Instrumental Variables with Treatment Effect Heterogeneity: Local Average Treatment Effects 暑期研究所2007年方法讲座: 治疗效果异质性的工具变量: 局部平均治疗效果 Summer Institute 2007 Methods Lecture: Control Function and Related Methods 暑期学院2007方法讲座: 控制作用及相关方法 Summer Institute 2007 Methods Lecture: Bayesian Inference 2007年夏季学院方法讲座: 贝叶斯推断 Summer Institute 2007 Methods Lecture: Cluster and Stratified Sampling 2007年夏季研究所方法讲座: 集群和分层抽样 Summer Institute 2007 Methods Lecture: Partial Identification 暑期学院2007方法讲座: 部分鉴定 Summer Institute 2007 Methods Lecture: Difference-in-Differences Estimation 夏季学院2007年方法讲座: 差异中的差异估计 Summer Institute 2007 Methods Lecture: Discrete Choice Models 夏季学院2007年方法讲座: 离散选择模型 Summer Institute 2007 Methods Lecture: Missing Data 2007年夏季研究所方法讲座: 缺失数据 Summer Institute 2007 Methods Lecture: Weak Instruments and Many Instruments 暑期学院2007方法讲座: 弱仪器和多种仪器 Summer Institute 2007 Methods Lecture: Quantile Methods 夏季研究所2007方法讲座: 分位数方法 https://space.bilibili.com/522173499?spm_id_from=333.788.b_765f7570696e666f.1 https://awstringer1.github.io/sta238-book/","categories":[{"name":"研究方法","slug":"研究方法","permalink":"http://xiahanlin1993.github.io/categories/%E7%A0%94%E7%A9%B6%E6%96%B9%E6%B3%95/"}],"tags":[{"name":"DID PSM RDD ML CI","slug":"DID-PSM-RDD-ML-CI","permalink":"http://xiahanlin1993.github.io/tags/DID-PSM-RDD-ML-CI/"}]},{"title":"如何使用hexo+gitte+typora建立个人博客网站？","slug":"如何使用hexo+gitte+typora建立个人博客网站？","date":"2021-08-19T17:30:32.000Z","updated":"2022-10-11T17:48:47.181Z","comments":true,"path":"2021/08/20/ru-he-shi-yong-hexo-gitte-typora-jian-li-ge-ren-bo-ke-wang-zhan/","link":"","permalink":"http://xiahanlin1993.github.io/2021/08/20/ru-he-shi-yong-hexo-gitte-typora-jian-li-ge-ren-bo-ke-wang-zhan/","excerpt":"","text":"一、准备工作1.安装git在各大电脑管家安装（我是用的是联想自带的电脑管家），速度比较快一点，用git官方安装速度太慢，不建议。 2.安装node.jsnode.js其自带npm，用来下载hexo插件，建议下载国内cnpm，速度较快 https://nodejs.org/zh-cn/ #node.js中文网站 npm install -g cnpm --registry=https://registry.npm.taobao.org cnpm install hexo-symbols-count-time #利用cnpm安装hexo插件 二、安装hexo（官网）启动Git Bash Here，然后输入命令： npm install hexo-cli -g 手动在d盘下建立blog文件夹，d:\\blog或者使用命令： mkdir blog 首先进行初始化在本地生成Hexo相关目录： hexo init 然后就可以使用Hexo三连了，即我们最常用的三个主要命令（依旧在上述Git Bash命令端口中）： hexo clean # 清空已有hexo网站文件 hexo generate(or g) # 依据网页文本与新的CSS样式生成新网站文件 hexo server(or s) # 启动本地服务器，可以在localhost:4000查看网站修改效果 依次运行上述三个命令，就可以在浏览器打开localhost:4000端口，查看对应网站界面效果，一般默认的是一个landscape主题，后期当提交新文章或者新的样式修改时，往往都是先从本地查看结果无误后再部署到Gitee Page。至此最简单的个人博客建立工作就已经完成了。接下来是如何部署到网上，让别人也能看到你的个人博客网站。 三、 把博客部署到码云上 首先说明一下，为什么选择码云，最近 GitHub 经常性蹦，访问也比较慢，所以我就选择了码云实现一下，当然你有服务器就最好不过了。 码云（gitee）：https://gitee.com/ 1. 注册码云，创建仓库我们需要在 gitee 创建自己的账户（如果没有），然后再创建一个自己仓库 输入仓库名称，其它默认即可，这里因为我已经创建了。 这里强烈建议使用与归属名相同的仓库名和路径名，最后会产生个人博客的网站时，没有二级目录，如https://www.xiahanlin.gitte.io 2. 生成/添加 SSH 公钥码云 Gitee 、GitHub 提供了基于 SSH 协议的 Git 服务，在使用 SSH 协议访问仓库仓库之前，需要先配置好账户/仓库的 SSH 公钥。 2.1 配置 ssh 账户和邮箱 邮箱不必与 Gitee 账号相同，个人邮箱即可。 git config --global user.email *********@163.com # 设置邮箱 git config --global user.name '****' # 设置用户名 查看账户和邮箱 git config --global user.name git config --global user.email 2.2 本地生成ssh公钥 邮箱为刚配置好的账户邮箱 ssh-keygen -t rsa -C \"xxxxx@xxxxx.com\" 按照提示完成三次回车，即可生成 ssh key 2.3查看 ssh 公钥 vim ~/.ssh/id_rsa.pub # 退出 :qa! 复制公钥去 Gitee 粘贴，添加 2.4 测试是否连接成功 码云 Gitee ssh -T git@gitee.com 如下图所示，则表示连接成功 2.5 配置连接 Gitee进入到我们新创建的仓库，复制项目地址 复制 URL ，到 hexo 的配置文件 _config.yml，相应位置修改成如下： 四、部署博客1.安装自动部署发布工具cnmp install hexo-deployer-git --save 新建 deployer.sh 文件，输入代码： hexo clean hexo g hexo d 一键部署博客 sh deployer.sh 2.Gitee Pages 设置在项目的服务中选择 Pages 选项 默认配置，点击启动即可 下图则成功开启，记住博客地址，之后可以点更新进行操作 博客发布成功之后，可以访问博客地址：xxxxxx，就可通过他提供的博客地址进行访问，预览在线博客啦！！ 如果博客的样式不对，则需要在_config.yml中配置下博客地址和路径： url: “码云提供给您的博客地址” #如https://www.xiahanlin.gitte.io root: / 五、主题配置下载自己喜欢的主题，可以去hexo官网主题探索。这里我是用的是next主题，可以去next github仓库中下载压缩包然后放到博客项目根目录下的 themes 中。 然后配置站点 _config.yml theme: “您的主题文件夹完整名称” # 这里需要注意:后面要有一个空格，名称要和theme下的主题目录名称相同。 修改完成，本地运行 hexo s 测试成功即可上传部署到 Gitee 然后点击更新即可。 六、主题优化1.Next主题风格Next提供了四中主题风格scheme，可以在主题配置文件blog/themes/next/_config.yml文件中进行选择，分别是Muse、Mist、Pisces、Gemini： 我目前使用的是第一个布局。 Next主题一般配置： override: false # Console reminder if new version released. reminder: false # Allow to cache content generation. Introduced in NexT v6.0.0. cache: enable: true #表示添加缓存功能，这样浏览器后续打开我们的博客网站会更快 # Remove unnecessary files after hexo generate. minify: false # Define custom file paths. # Create your custom files in site directory `source/_data` and uncomment needed files below. custom_file_path: #head: source/_data/head.swig #header: source/_data/header.swig #sidebar: source/_data/sidebar.swig #postMeta: source/_data/post-meta.swig #postBodyEnd: source/_data/post-body-end.swig #footer: source/_data/footer.swig #bodyEnd: source/_data/body-end.swig #variable: source/_data/variables.styl #mixin: source/_data/mixins.styl #style: source/_data/styles.styl # --------------------------------------------------------------- # Site Information Settings # See: https://theme-next.org/docs/getting-started/ # --------------------------------------------------------------- favicon: small: /images/16×16.png medium: /images/32×32.png apple_touch_icon: /images/128×128.png safari_pinned_tab: /images/icon-close.svg #android_manifest: /images/manifest.json #ms_browserconfig: /images/browserconfig.xml # Show multilingual switcher in footer. language_switcher: false footer: # Specify the date when the site was setup. If not defined, current year will be used. since: 2021 #建站时间 2.添加小宠物 npm install --save live2d-widget-model-epsilon2_1 npm install --save live2d-widget-model-haruto npm install --save live2d-widget-model-hibiki npm install --save live2d-widget-model-hijiki npm install --save live2d-widget-model-izumi npm install --save live2d-widget-model-koharu npm install --save live2d-widget-model-tororo 七、问题解决1.hexo框架下，如何解决图片插入？试了好多方法，发现下面这种方法是可行，结合typora。 使用最简单的方式在 source 目录下创建images目录，然后图片都保存在这里。 关键是要在typora上做以下设置： 在md文件头部的配置项中，添加 typora-root-url: ../ --- title: hexo+typora 插入图片 date: 2019-06-08 10:37:22 tags: typora-root-url: ../ ---Copy 这样引用的图片都以上一级目录即 sourse作为根目录了，并在偏好设置中，设置插入插入图片复制到指定到路径，此时插入的图片，都会自动保存在 sourse/images目录下，并且本地的显示和服务器上的根目录完全一致，使用体验还是很方便的。 总结以上，就是在每篇md文件中，开头设置typora-root-url: ../，然后设置偏好设置，就可以既实现typora本地实时预览和网上配图的完美结合。 一次配置，永久实现，在scaffolds文件夹下的post.md，是每次hexo n 的默认模板，可以通过更改它，实现每次新建md文件，就已经配置好，然后在typora设置一下，就可以永久不用担心图片在博客中的现实问题。 8.测试代码和公式支持 **** 合并数据 **** use C:\\Users\\msi\\Desktop\\数据处理\\asset.dta,replace merge m:m BankCode Date using C:\\Users\\msi\\Desktop\\数据处理\\operation.dta,nogen merge m:m BankCode Date using C:\\Users\\msi\\Desktop\\数据处理\\profit.dta,nogen merge m:m BankCode Date using C:\\Users\\msi\\Desktop\\数据处理\\creditlossprepare.dta,nogen **** 转换文字变量为数字变量和日期变量 **** destring BankCode,gen(Code) gen date = date(Date,\"YMD\") format date %td tsset Code date drop BankCode drop Date label var Code 银行代码 label var BankName 银行名称 label var date 统计日期 label var FCIC 手续费及佣金收入 label var NIAPC 归属于母公司所有者的净利润 label var BEPS 基本每股收益 label var REV 营业收入 label var TDepo 存款总额 label var TLoan 贷款总额 label var CptAdqRt \"资本充足率(%)\" label var NpfLnRt5 不良贷款比例 label var NpfPpCvRt5 不良贷款拨备覆盖率 label var CsIncRt \"成本收入比(%)\" label var TA 资产总计 label var EAPC 归属于母公司所有者权益合计 label var DdLnRsvfd \"贷款呆帐准备金\" **** 导出为excel格式 **** export excel using \"C:\\Users\\msi\\Desktop\\数据处理\\年度数据.xls\", sheetreplace firstrow(varlabels) \\frac{x^2}{y^2}*z^2=m^2+n^2$y^2=2$ $y^2=2$ y^2=3--- title: 基于Hexo的hexo-theme-matery主题搭建博客并优化 date: 2019-10-03 14:25:00 author: 悟尘 img: /source/images/xxx.jpg top: true cover: true coverImg: /images/1.jpg password: 8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92 toc: false mathjax: false summary: 这是你自定义的文章摘要内容，如果这个属性有值，文章卡片摘要就显示这段文字，否则程序会自动截取文章的部分内容作为摘要 categories: 工具 tags: - blog - hexo --- Front-matter 选项中的所有内容均为非必填的。但我仍然建议至少填写 title 和 date 的值。 配置选项 默认值 描述 title Markdown 的文件标题 文章标题，强烈建议填写此选项 date 文件创建时的日期时间 发布时间，强烈建议填写此选项，且最好保证全局唯一 author 根 _config.yml 中的 author 文章作者 img featureImages 中的某个值 文章特征图，推荐使用图床(腾讯云、七牛云、又拍云等)来做图片的路径.如: http://xxx.com/xxx.jpg top true 推荐文章（文章是否置顶），如果 top 值为 true，则会作为首页推荐文章 cover false v1.0.2版本新增，表示该文章是否需要加入到首页轮播封面中 coverImg 无 v1.0.2版本新增，表示该文章在首页轮播封面需要显示的图片路径，如果没有，则默认使用文章的特色图片 password 无 文章阅读密码，如果要对文章设置阅读验证密码的话，就可以设置 password 的值，该值必须是用 SHA256 加密后的密码，防止被他人识破。前提是在主题的 config.yml 中激活了 verifyPassword 选项 toc true 是否开启 TOC，可以针对某篇文章单独关闭 TOC 的功能。前提是在主题的 config.yml 中激活了 toc 选项 mathjax false 是否开启数学公式支持 ，本文章是否开启 mathjax，且需要在主题的 _config.yml 文件中也需要开启才行 summary 无 文章摘要，自定义的文章摘要内容，如果这个属性有值，文章卡片摘要就显示这段文字，否则程序会自动截取文章的部分内容作为摘要 categories 无 文章分类，本主题的分类表示宏观上大的分类，只建议一篇文章一个分类 tags 无 文章标签，一篇文章可以多个标签 keywords 文章标题 文章关键字，SEO 时需要 reprintPolicy cc_by 文章转载规则， 可以是 cc_by, cc_by_nd, cc_by_sa, cc_by_nc, cc_by_nc_nd, cc_by_nc_sa, cc0, noreprint 或 pay 中的一个 八、插入PDF如果我们想在word上编辑，然后放到博客上，可以先利用word另存为pdf，然后利用pdf插件实现。这一点在我所使用的Next6主题中采用了，具体如下： step1 安装pdf插件 进入我们博客的主题目录，如blog/themes/next6，执行： git clone https://github.com/theme-next/theme-next-pdf source/lib/pdf 或者在blog/目录下执行： npm install hexo-pdf --save step2 hexo 配置（如果采用第一种安装方式） pdf: enable: true per_page: true height: 500px pdfobject: cdn: //cdnjs.cloudflare.com/ajax/libs/pdfobject/2.1.1/pdfobject.min.js step3 存放pdf 存放pdf的方式跟图片一模一样，具体我就不说了 step4 插入pdf 官方支持的方式是 [](pdf链接) 而采用方法二的使用方式是： &#123;% pdf pdf链接 %&#125; 官方的那个我总是编译出问题，所以下面给出方法二的效果： 九、配置个性化域名配置个性化域名一顿操作下来，打开我们的博客还是：www.xxx.github.io，是不是很没有牌面？我们可以考虑购买一个专属域名，以后打开博客就是这样：www.xxx.com 。 阿里云和腾讯云都可以，我的是腾讯云，购买域名后首先需要添加解析： 方法一：点击添加记录，需要添加两个记录，两个记录类型都是 CNAME ，第一个主机记录为 @ ，第二个主机记录为 www，记录值都是填你自己的博客地址（比如我的是：muyiio.github.io），保存之后域名解析就完成了！ 方法二：两个记录类型为 A ，第一个主机记录为 @ ，第二个主机记录为 www，记录值都为博客的 IP 地址，IP 地址可以 cmd 中输入 ping 你的博客地址 获得（比如我的：ping muyiio.github.io），保存之后域名解析就完成了！ 参考资料： 《域名解析中A记录、CNAME、MX记录、NS记录的区别和联系》 不管在哪个平台购买域名，操作都大同小异，这里说明两点： 如果你填写的是没有www的，比如 muyio.com，那么无论是访问 https://www.muyiio.com 还是 https://muyiio.com ，都会自动跳转到 https://muyiio.com。 如果你填写的是带www的，比如 www.muyiio.com ，那么无论是访问 https://www.muyiio.com 还是 https://muyiio.com ，都会自动跳转到 http://www.imuyiio.com。 然后打开你的github博客项目，点击settings，拉到下面Custom domain处，填上你自己的域名，保存就可以了。 现在我们的项目根目录应该会出现一个名为CNAME的文件了。如果没有的话，打开你本地博客/source目录，我的是C:\\Blog\\Hexo\\source，新建CNAME文件，（注意不要加.txt，没有任何后缀名！）。然后在里面写上你的域名，保存。最后运行hexo g、hexo d上传到github。 现在就可以通过我们的个性化域名：www.xxx.com、xxx.com访问自己的博客了","categories":[],"tags":[]}],"categories":[{"name":"研究方法","slug":"研究方法","permalink":"http://xiahanlin1993.github.io/categories/%E7%A0%94%E7%A9%B6%E6%96%B9%E6%B3%95/"}],"tags":[{"name":"DID PSM RDD ML CI","slug":"DID-PSM-RDD-ML-CI","permalink":"http://xiahanlin1993.github.io/tags/DID-PSM-RDD-ML-CI/"}]}